<script>
    import Header from '../components/header.vue'
    import Footer from '../components/footer.vue'
    export default {
        name: 'Main',
        components: {
            Header,
            Footer
        },
    }
</script>
<template>
    <Header />
    <div class="main">
        <section>
	    	<div class="main-section">
                <div class="main-image">
                    <img src="../assets/banner1.jpg" alt="">
                </div>
	    		<div class="main-section-desc">
	    			<h2>О нашем магазине</h2>
	    			<p>Наш магазин является одним из самых популярных поставщиков товаров из мультика "Хранители снов". 
	    			Мы предлагаем широкий ассортимент товаров, охватывающих все популярные персонажи и предметы из мультипликационного фильма. 
	    			Нашей главной целью является удовлетворение потребностей наших клиентов и предоставление им лучших продуктов под брендом "Хранители снов".</p>
	    			<p>Мы гордимся тем, что наш магазин отличается высоким качеством продукции. 
	    			Мы тщательно отбираем поставщиков, чтобы убедиться, что наши клиенты получают только самые лучшие товары. 
	    			Каждый продукт, который мы предлагаем, проходит строгий контроль качества, чтобы удовлетворить требования и ожидания наших покупателей.</p>
	    			<p>Мы также гарантируем высокий уровень обслуживания. Наша команда профессиональных сотрудников всегда готова помочь вам с любыми вопросами или проблемами. 
	    			Мы работаем над тем, чтобы каждый клиент получил опыт покупки, который он заслуживает.</p>
	    			<p>Если вы являетесь поклонником мультика "Хранители снов" и ищете качественные продукты, которые отражают любовь к этой истории, то наш магазин - идеальное место для вас. 
	    			Мы предлагаем уникальные и оригинальные товары, которые позволят вам выразить свою любовь и стать частью волшебного мира этого замечательного мультипликационного фильма.</p>
	    		</div>
	    	</div>
	    </section>
        <section>
            <div class="main-section">
	    		<div class="main-section-desc">
	    			<h2>Наши преимущества</h2>
	    			<ul>
	    				<li>Широкий ассортимент товаров</li>
	    				<p>Мы обладаем огромным выбором товаров, чтобы удовлетворить различные потребности наших клиентов. 
	    				<br>Независимо от того, ищете ли вы электронику, одежду, товары для дома или аксессуары, у нас найдется подходящий вариант для вас.</p>
	    				<li>Быстрая доставка</li>
	    				<p>Мы ценим время наших клиентов и стремимся обеспечить быструю и надежную доставку наших товаров. 
	    				<br>Мы сотрудничаем с надежными курьерскими службами, чтобы ваш заказ был доставлен в кратчайшие сроки.</p>
	    				<li>Отличное качество наших товаров</li>
	    				<p>Мы гарантируем высокое качество всех наших товаров. 
	    				<br>Мы тщательно отбираем поставщиков и проверяем качество каждого товара перед его отправкой на склад. 
	    				<br>Мы стремимся предоставить нашим клиентам только лучшие товары.</p>
	    			</ul>
	    		</div>	
                <div class="main-image">
                    <img src="../assets/banner2.jpg" alt="">
                </div>
            </div>
        </section>	
    </div>
    <Footer />
</template>
<style>
    .main-section {
        display: flex;
        justify-content: space-around;
        align-items: center;
        height: 90vh;
        border-bottom: 1px solid;
        box-shadow: 0 0 24px #fff;
    }
    .main-section-desc {
        width: 60%;
        text-align: justify;
        padding: 15px;
    }
    .main-image img {
        border-radius: 25px;
    }
    ul {
        list-style-position: inside;
    }
</style>